<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html lang=es xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <title></title>
	<meta charset="UTF-8">
	<meta http-equiv="Content-type" content="text/html; charset=UTF-8">
    <style type="text/css">
/*<![CDATA[*/
    :link { color: #0563C1 }
    :visited { color: #954F72 }
    b.cleanuphtml-3 {font-style: italic}
    p.cleanuphtml-2 {text-align: center}
    a.cleanuphtml-1 {font-weight: bold}
    /*]]>*/
    </style>

  <!-- Clean HTML generated by http://www.cleanuphtml.com/ -->
	<meta name="Generator" content="Cleanup HTML"></head>

  <body>

  <div class="panel-group" id="accordion">

    <div class="panel panel-default">
      <div class="panel-heading"><h4 class="panel-title"><a data-toggle="collapse" data-parent="#accordion" href="#collapse1">Ensamblador en WepSIM</a></h4></div>
      <div id="collapse1" class="panel-collapse collapse in">
        <div class="panel-body" style="height:65vh; width: inherit; overflow-y: scroll;">

	      <p>
	      </p>
	      <p>
	        El c&oacute;digo en ensamblador se describe en un fichero de texto con una primera secci&oacute;n de datos (.data) y una segunda secci&oacute;n para el c&oacute;digo (.text)<br />
	        <br />
	        En la secci&oacute;n de datos es posible definir las variables y constantes que se alojar&aacute;n en el segmento de datos de la memoria principal. Dicha secci&oacute;n comienza con la directiva <i>.data</i>. Las
	        directivas que permiten especificar los distintos tipos de datos que pueden definirse son:
	      </p>
	      <p>
	        &middot;       <b>.ascii:</b> va seguida de la cadena de caracteres, instruyendo al ensamblador para crear una zona de memoria con datos, y almacenar en ella la cadena que se indique.
	      </p>
	      <p>
	        &middot;       <b>.asciiz:</b> va seguida de la cadena de caracteres, instruyendo al ensamblador para crear una zona de memoria con datos, y almacenar en ella la cadena que se muestra terminado por
	        un byte con valor cero.
	      </p>
	      <p>
	        &middot;       <b>.byte:</b> va seguida de uno o m&aacute;s valores que formar&aacute;n parte del valor de la variable. En caso de varios valores, dichos valores se separar&aacute;n por coma. Para los valores se puede
	        usar: <b>car&aacute;cter, octal, hexadecimal y decimal</b>.
	      </p>
	      <p>
	        &middot;       <b>.half:</b> va seguida de uno o m&aacute;s valores que formar&aacute;n parte del valor de la variable. En caso de varios valores, dichos valores se separar&aacute;n por coma.<br />
	        Para los valores se puede usar: <b>octal, hexadecimal y decimal.</b>
	      </p>
	      <p>
	        &middot;       <b>.word:</b> va seguida de uno o m&aacute;s valores que formar&aacute;n parte del valor de la variable. En caso de varios valores, dichos valores se separar&aacute;n por coma.<br />
	        Para los valores se puede usar: <b>octal, hexadecimal y decimal.</b>
	      </p>
	      <p>
	        &middot;       <b>.space:</b> va seguida del n&uacute;mero de bytes, en formato decimal, que el usuario desea reservar en memoria.
	      </p>
	      <p>
	        El formato de un valor de los tipos de datos comentados es:
	      </p>
	      <p>
	        &middot;       <b>Cadena de caracteres:</b> secuencia de caracteres entre comillas dobles.<br />
	        Por ejemplo: "hola 123\n"
	      </p>
	      <p>
	        &middot;       <b>Car&aacute;cter:</b> car&aacute;cter entre comillas simples.<br />
	        Por ejemplo: &apos;c&apos;.
	      </p>
	      <p>
	        &middot;       <b>Octal:</b> un n&uacute;mero que comienza por cero y sus d&iacute;gitos son menores que ocho. Por ejemplo: 012.
	      </p>
	      <p>
	        &middot;       <b>Hexadecimal:</b> un n&uacute;mero que comienza por el prefijo 0x y sus d&iacute;gitos son del cero al nueve y las letras a, b, c, d, e y f.<br />
	        Por ejemplo: 0x12.
	      </p>
	      <p>
	        &middot;       <b>Decimal:</b> un n&uacute;mero que no est&aacute; en formato octal o hexadecimal con d&iacute;gitos comprendidos entre el cero y el nueve (ambos incluidos).<br />
	        Por ejemplo: 12.
	      </p>
	      <p>
	        En la secci&oacute;n de c&oacute;digo es posible definir las subrutinas que se alojar&aacute;n en el segmento de c&oacute;digo de la memoria principal. Dicha secci&oacute;n comienza con la directiva <i>.text</i>.
	      </p>
	      <p>
	         
	      </p>
	      <p>
	        Es posible usar comentarios de l&iacute;nea usando el car&aacute;cter #<br />
	        Todo lo que hay a continuaci&oacute;n de este car&aacute;cter hasta el final de l&iacute;nea ser&aacute; ignorado por el ensamblador.
	      </p>
	      <p>
	        Un ejemplo programa ser&iacute;a:
	      </p>
	      <p>
	        .data
	      </p>
	      <p>
	                  age1:    .word   0x12345678, 20     
	      </p>
	      <p>
	                  age2:    .word   20 , 10
	      </p>
	      <p>
	                  resultado: .word 0
	      </p>
	      <p>
	                  # 32-bit word initialized with decimal
	      </p>
	      <p>
	                  texto: .ascii "Hola\t"
	      </p>
	      <p>
	                  texto2: .asciiz "Hola\t"
	      </p>
	      <p>
	                  hueco: .space 16
	      </p>
	      <p>
	        .text
	      </p>
	      <p>
	        .globl main
	      </p>
	      <p>
	        main:  li $3 2
	      </p>
	      <p>
	                   li $4 1
	      </p>
	      <p>
	                   li $5 0<br />
	        <br />
	      </p>
	      <p class="cleanuphtml-2">
	        <a class="cleanuphtml-1" name="_Toc438322908">Figura</a> <b>19</b> <b>Ejemplo de secciones de dato y c&oacute;digo en ensamblador para probar microc&oacute;digos</b><b><br />
	        <br /></b>
	      </p>

        </div>
      </div>
    </div>


    <div class="panel panel-default">
      <div class="panel-heading"><h4 class="panel-title"><a data-toggle="collapse" data-parent="#accordion" href="#collapse2">Gesti&oacute;n del ensamblador en WepSIM</a></h4></div>
      <div id="collapse2" class="panel-collapse collapse">
        <div class="panel-body" style="height:65vh; width: inherit; overflow-y: scroll;">

	      <p>
	        Un fichero de texto con las dos secciones antes comentadas (datos y c&oacute;digo) se carga en la pantalla de Ensamblador. Para acceder a dicha pantalla se ha de ir al men&uacute; (parte superior derecha)
	        e indicar la opci&oacute;n Assembly (v&eacute;ase la <b class="cleanuphtml-3">Figura 16</b>)<br />
	        <br />
	      </p>
	      <p>
	        <img id="Imagen 3" src="sim_help_assembly_archivos/image002.jpg" width="80%" alt="" name="Imagen 3" />
	      </p>
	      <p class="cleanuphtml-2">
	        <a name="_Toc438322909"></a><a class="cleanuphtml-1" name="_Toc434155501">Figura</a> <b>20</b> <b>Pantalla principal: opci&oacute;n de carga de c&oacute;digo ensamblador</b>
	      </p>
	      <p>
	        A continuaci&oacute;n aparecer&aacute; una pantalla con un cuadro de texto que permite indicar el c&oacute;digo en ensamblador. Es posible cargar un c&oacute;digo existente usando el bot&oacute;n "Load" de la barra superior,
	        modificar un c&oacute;digo anteriormente cargado o salvar el c&oacute;digo actualmente en cargado con el bot&oacute;n "Save" de la barra inferior.
	      </p>
	      <p>
	        Una vez se indique el c&oacute;digo es preciso hacer clic en el bot&oacute;n "Compile" para pasar a binario y cargar en la memoria de principal el binario resultante, 
		tal y como se muestra en la <b class="cleanuphtml-3">Figura 21</b>. 
	      </p>
	      <p>
	         
	      </p>
	      <p>
	        <img id="Imagen 28" src="sim_help_assembly_archivos/image003.jpg" width="80%" alt="" name="Imagen 28" />
	      </p>
	      <p class="cleanuphtml-2">
	        <a name="_Toc438322910"></a><a class="cleanuphtml-1" name="_Ref434192102">Figura</a> <b>21</b> <b>Pantalla ensamblador: cuadro de texto con ensamblador a cargar</b><b><br />
	        <br /></b>
	      </p>
	      <p>
	        Una vez compilado, se pasar&aacute; a la pantalla indicada en la <b class="cleanuphtml-3">Figura 23</b>, donde se mostrar&aacute; el contenido de la memoria principal en binario.
	      </p>
	      <p>
	         
	      </p>
	      <p>
	        <img id="Imagen 30" src="sim_help_assembly_archivos/image005.jpg" width="80%" alt="" name="Imagen 30" />
	      </p>
	      <p class="cleanuphtml-2">
	        <a name="_Toc438322912"></a><a class="cleanuphtml-1" name="_Ref434192450">Figura</a> <b>23</b> <b>Pantalla ensamblador: c&oacute;digo finalmente compilado</b>
	      </p>
	      <p>
	        <br />
	        El siguiente paso es ir a la pantalla principal para ejecutar la combinaci&oacute;n de <i>firmware</i> y ensamblador cargado, para lo que ha de pulsar el bot&oacute;n "Simulador" de la barra inferior.
	      </p>
	      <p>
	         
	      </p>

        </div>
      </div>
    </div>

  </body>
</html>

